Revit 2026 API

# BuiltInFailures Class

---

Provides a container of all Revit built-in FailureDefinitionId instances.

SystemObject Autodesk.Revit.DBBuiltInFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class BuiltInFailures
```
```vb
Public NotInheritable Class BuiltInFailures
```
```cpp
public ref class BuiltInFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type BuiltInFailures = class end
```

#### Reference

Autodesk.Revit.DB Namespace